[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:140:62
    * @param location New location for this player
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
-    const conversation = this.conversationAreas.find(conv => conv.label === location.conversationLabel);
+    const conversation = this.conversationAreas.find(conv => false);
     const prevConversation = player.activeConversationArea;
 
killedBy: CoveyTownController town listeners and events should remove a player from conversation when their session is destroyed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:169:79
    * @param conversation Conversation area to remove player from
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea) : void {
-    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>p === player.id), 1);
+    conversation.occupantsByID.splice(conversation.occupantsByID.findIndex(p=>true), 1);
     if (conversation.occupantsByID.length === 0) {
       this._conversationAreas.splice(this._conversationAreas.findIndex(conv => conv === conversation), 1);
